#+title: The Software Deployment Problem and Guix
#+startup align

* The heap

  A directory that contains build artifacts and "other stuff" related
  to managing artifacts.

  In Guix this lives in /gnu/store:

  #+begin_src shell
  ls /gnu/store | tail -n 5
  #+end_src

  #+RESULTS:
  | zzxx9zag1jlix8dh78n23zjmdqmv4ljg-guix-system-builder             |
  | zzxyyqsxm52w4bf31cv4p821wrvvh1jz-rust-fuchsia-zircon-0.3.3.crate |
  | zzzf3r7fv383kfrzx22awaynl5m935y8-rust-derive-more-0.13.0.tar.gz  |
  | zzzjly6b9b9n7jq7zv67mzm4gz0mkz2s-microlens-0.4.10.tar.gz.drv     |
  | zzzpwcjwyxfjs31jdbg5lrvnwwbxai6a-ghc-monadrandom-0.5.1.1.drv     |

